Create a series with following elements using a list,elements are simple (10,20,30,40)

In [2]:
import pandas as pd

In [3]:
s1=pd.Series([10,20,30,40])

In [4]:
s1

0    10
1    20
2    30
3    40
dtype: int64

In [5]:
s2=pd.Series([10,20,30,40],index=['a','b','c','d'])
s2

a    10
b    20
c    30
d    40
dtype: int64

In [6]:
pd.Series({'a':10,'b':20,'c':30,'d':40})

a    10
b    20
c    30
d    40
dtype: int64

Create a dataframe to store students personal details like First name,Last name ,age and city,Store the details of atleast 5 students

In [11]:
student={'First Name':['Akhil','Aditya','Archit','Arjun','Agrim'],'Last Name':['Pandey','Pratap','Awasthi','Singh','Shukla'],'Age':[20,20,20,20,15],'City':['Kanpur','Lucknow','Lucknow','Lucknow','Lucknow']}

In [12]:
student

{'First Name': ['Akhil', 'Aditya', 'Archit', 'Arjun', 'Agrim'],
 'Last Name': ['Pandey', 'Pratap', 'Awasthi', 'Singh', 'Shukla'],
 'Age': [20, 20, 20, 20, 15],
 'City': ['Kanpur', 'Lucknow', 'Lucknow', 'Lucknow', 'Lucknow']}

In [13]:
pd.DataFrame(student)

  First Name Last Name  Age     City
0      Akhil    Pandey   20   Kanpur
1     Aditya    Pratap   20  Lucknow
2     Archit   Awasthi   20  Lucknow
3      Arjun     Singh   20  Lucknow
4      Agrim    Shukla   15  Lucknow

In [18]:
s1=pd.Series(['Akhil', 'Aditya', 'Archit', 'Arjun', 'Agrim'])
s2=pd.Series(['Pandey', 'Pratap', 'Awasthi', 'Singh', 'Shukla'])
s3=pd.Series([20, 20, 20, 20, 15])
s4=pd.Series(['Kanpur', 'Lucknow', 'Lucknow', 'Lucknow', 'Lucknow'])
df=pd.DataFrame({
    'First Name':s1,
    'Last Name':s2,
    'Age':s3,
    'City':s4
})
df

  First Name Last Name  Age     City
0      Akhil    Pandey   20   Kanpur
1     Aditya    Pratap   20  Lucknow
2     Archit   Awasthi   20  Lucknow
3      Arjun     Singh   20  Lucknow
4      Agrim    Shukla   15  Lucknow

Print the age of all students

In [22]:
df['Age']

0    20
1    20
2    20
3    20
4    15
Name: Age, dtype: int64

Find the details of students who live in Kanpur

In [29]:
df[df['City']=='Kanpur']

  First Name Last Name  Age    City
0      Akhil    Pandey   20  Kanpur

In [30]:
df[df['Age']>=20]

  First Name Last Name  Age     City
0      Akhil    Pandey   20   Kanpur
1     Aditya    Pratap   20  Lucknow
2     Archit   Awasthi   20  Lucknow
3      Arjun     Singh   20  Lucknow

Find First Name and Last Name of students where age is >20

In [34]:
name=df[df['Age']>=20]
name[['First Name','Last Name']]

  First Name Last Name
0      Akhil    Pandey
1     Aditya    Pratap
2     Archit   Awasthi
3      Arjun     Singh

Use .loc to find the students live in lucknow

In [35]:
df.loc[df['City']=='Lucknow']

  First Name Last Name  Age     City
1     Aditya    Pratap   20  Lucknow
2     Archit   Awasthi   20  Lucknow
3      Arjun     Singh   20  Lucknow
4      Agrim    Shukla   15  Lucknow